################ シンドローム ################
use strict;
use utf8;

package data;

our @igrs = (
  "悪役",
  "攻略対象",
  "主人公",
  "モブ",
  "不在"
);

our %igrs_status = (
  "悪役"     => [13, 10, 11, 11,  7,  8],
  "攻略対象" => [ 7,  8,  8,  7, 15, 15],
  "主人公"   => [ 8,  9,  8,  9, 20,  6],
  "モブ"     => [12, 14, 10, 12,  7,  5],
  "不在"     => [10, 12, 12, 15,  6,  5]
);

our @elements = (
  "罪人",
  "無垢",
  "賢人",
  "近待",
  "芸人",
  "天才",
  "貴族",
  "豪商",
  "市民",
  "異邦人"
);

our %elements_statsu = (
  "罪人"   => [4, 9, 2, 5, 4, 4],
  "無垢"   => [0, 6, 6, 3, 9, 4],
  "賢人"   => [3, 4, 9, 4, 4, 4],
  "近待"   => [6, 6, 5, 3, 4, 4],
  "芸人"   => [6, 5, 8, 6, 2, 2],
  "天才"   => [4, 6, 8, 6, 2, 2],
  "貴族"   => [4, 2, 4, 4, 6, 8],
  "豪商"   => [4, 4, 5, 5, 2, 8],
  "市民"   => [6, 6, 6, 6, 2, 2],
  "異邦人" => [4, 5, 4, 4, 6, 5]
);

our @homes = (
  "転生者",
  "現地人"
);

## シンドロームリスト
our @syndromes = (
  'エンジェルハィロゥ',
  'バロール',
  'ブラックドッグ',
  'ブラム＝ストーカー',
  'キュマイラ',
  'エグザイル',
  'ハヌマーン',
  'モルフェウス',
  'ノイマン',
  'オルクス',
  'サラマンダー',
  'ソラリス',
  'ウロボロス',
  'アザトース',
);

## 能力値補正
our %syndrome_status = (
  'エンジェルハィロゥ' => [0,3,1,0],
  'バロール'           => [0,1,2,1],
  'ブラックドッグ'     => [2,1,1,0],
  'ブラム＝ストーカー' => [1,2,1,0],
  'キュマイラ'         => [3,0,0,1],
  'エグザイル'         => [2,1,0,1],
  'ハヌマーン'         => [1,1,1,1],
  'モルフェウス'       => [1,2,0,1],
  'ノイマン'           => [0,0,3,1],
  'オルクス'           => [0,1,1,2],
  'サラマンダー'       => [2,0,1,1],
  'ソラリス'           => [0,0,1,3],
  'ウロボロス'         => [1,1,2,0],
  'アザトース'         => [1,0,3,0],
);

## 覚醒・衝動リスト
our @awakens = (
  ['死'  ,18],
  ['憤怒',17],
  ['素体',16],
  ['感染',14],
  ['渇望',17],
  ['無知',15],
  ['犠牲',16],
  ['命令',15],
  ['忘却',17],
  ['探求',14],
  ['償い',18],
  ['生誕',17],
  ['label=CRC用'],
  ['恐怖',17],
  ['救済',16],
  ['狂気',15],
  ['神命',15],
  ['実験',18],
);
our @impulses = (
  ['解放',18],
  ['吸血',17],
  ['飢餓',14],
  ['殺戮',18],
  ['破壊',16],
  ['加虐',15],
  ['嫌悪',15],
  ['闘争',16],
  ['妄想',14],
  ['自傷',16],
  ['恐怖',17],
  ['憎悪',18],
);

1;